Repository: BoranAliHmoud/Distributor
Catalog: IDCoreTest/Resources/Controllers/CustomersAndAreasController.*.resx
Languages: ar

# ActionActiveVisit
source: Active Visit
ar: زيارة فعالة

# ActionEnd
source: Finish Work
ar: نهاية العمل

# ActionInactiveVisit
source: Inactive Visit
ar: زيارة غير فعالة

# ActionLocation
source: Record Location
ar: تسجيل موقع

# ActionStart
source: Start Work
ar: بداية العمل

# MsgChkLicExpiredLicense
source: Sorry, Your license is expired!
ar: عذرا النسخة الخاصة بك منتيهة الصلاحية

# MsgChkLicExpiredLicenseNotice
source: Your license is expired and App will stopped if not renewed soon!
ar: ترخيص التطبيق على وشك الانتهاء الرجاء المسارعة بتجديد الترخيص قبل توقف التطبيق عن العمل!

# MsgChkLicInuse
source: Sorry, This license is already inuse!
ar: عذرا تم تفعيل هذا الكود مسبقاً

# MsgChkLicInvalidLicense
source: Sorry, This key code is incorrect!
ar: عذرا هذا الكود غير صالح

# MsgChkLicSuccess
source: Welcome to IDistributor Full Version
ar: مرحبا بكم في نظام الموزع الذكي

# MsgChkLicTrial
source: Welcome to IDistributor Trial Version
ar: مرحبا بكم في النسخة التجريبية من نظام الموزع الذكي

# MsgCloseSessionSuccess
source: Session was closed successfully!
ar: تم إغلاق الجلسة بنجاح!

# MsgCompanyInfoError
source: Company Information is invalid!
ar: توجد مشكلة في معلومات الشركة!

# MsgGeneralInvalidToken
source: Invalid Access Token
ar: معلومات التوثيق غير صالحة

# MsgGeneralServerError
source: Sorry! Error on Server Side, Please try later
ar: نعتذر، حصل خطأ على الخادم يرجى المحاولة لاحقا

# MsgIDVNoUpdate
source: No Data update is required
ar: لا توجد بيانات جديدة للتحديث

# MsgInvalidInputData
source: Invalid Input Data
ar: البيانات المدخلة غير صالحة

# MsgLoadBalanceFailureDataIssue
source: Data Error: Qty is zero or no product or route
ar: خطأ في البيانات يجب أن تكون الكمية أكبر من الصفر

# MsgLoadBalanceFailureFileIssue
source: Loading Excel Sheet is not well formatted
ar: ملف التحميل غير منسق بالشكل المطلوب

# MsgLoginActiveSession
source: There is an active session for this user on another device
ar: تم تسجيل الدخول مسبقا لهذا المستخدم من جهاز آخر

# MsgLoginFail
source: Username or Password is wrong!
ar: معلومات اسم المستخدم أو كلمة السر غير صحيحة

# MsgLoginInactiveUser
source: Sorry this user is inactive currently!
ar: المستخدم المطلوب غير فعال

# MsgLoginRouteFail
source: Salesman and VanStock are not defined well for this user!
ar: خط التوزيع غير معرف لهذا المستخدم

# MsgLoginSuccess
source: User {0} has logged in successfully
ar: تم تسجيل الدخول بنجاح: {0}

# MsgLoginUpdateApp
source: You are using old version, Please update Application!
ar: النسخة الحالية نسخة قديمة يجب التحديث لآخر إصدار من التطبيق!

# MsgLoginWelcomeAgain
source: Welcome Again
ar: أهلا بعودتك مرة ثانية

# MsgLoginWrongInput
source: Incorrect Login Information. Please Check CompanyCode Username and Password.
ar: خطأ في معلومات رمز الشركة أو اسم المستخدم أو كلمة السر

# MsgLogoutNoActiveSession
source: No Active Session!
ar: لا توجد جلسة فعالة لهذا المستخدم حاليا

# MsgLogoutSuccess
source: User has logged out successfully
ar: تم تسجيل الخروج بنجاح

# MsgNoDataFound
source: No Data Found!
ar: لا يوجد بيانات

# MsgProcessReturnInvoiceStockIssue
source: Not allowed return quantities for Some Items:
ar: لا يسمح بالمرتجع لبعض المواد

# MsgProcessSalesInvoicePriceIssue
source: Mismatch Price Issue in Some Items:
ar: توجد مشكلة عدم تطابق سعر في بعض المواد

# MsgProcessSalesInvoiceStockIssue
source: No Available Stock for Some Items:
ar: لا يتوفر مخزون في السيارة من بعض المواد

# MsgProcessSalesInvoiceUnitIssue
source: Mismatch Unit Issue in Some Items:
ar: توجد مشكلة في واحدات بعض المواد:

# MsgRecordInactiveVisitSuccess
source: Visit has been recorded successfully
ar: تم تسجيل الزيارة والسبب بنجاح

# MsgRemoveAllItemsFailure
source: Cannot remove all items!
ar: لا يمكن حذف جميع العناصر!

# MsgRemoveItemIntegrationFailure
source: This item cannot be removed as it is linked with other items!
ar: لا يمكن حذف هذا العنصر حاليا لارتباطه بعناصر أخرى!

# MsgRemoveProductFailureHasStock
source: There is current stock from this product, please offload them first
ar: لا يمكن حذف المنتج حاليا بسبب وجود مخزون حاليا في أحد المخازن

# MsgRemoveSuccess
source: Item was removed successfully!
ar: تم حذف البيانات بنجاح!

# MsgRemoveWorkingAreaFailureHasCustomers
source: Working Area has customers inside it, please assign them to another area first
ar: لا يمكن حذف هذه المنطقة لوجود زبائن ضمنها

# MsgSubmitInvoicesFailure
source: Invoice(s) processing has failed!
ar: فشلت معالجة جميع البيانات

# MsgSubmitInvoicesPartialSuccess
source: Some Invocies Failed and others have been processed successfully
ar: لم تتم معالجة كافة البيانات بنجاح

# MsgSubmitOrdersFailure
source: Order(s) processing has failed!
ar: فشلت معالجة جميع البيانات

# MsgSubmitOrdersPartialSuccess
source: Some Orders Failed and others have been processed successfully
ar: لم تتم معالجة كافة البيانات بنجاح

# MsgSubmitPaymentsFailure
source: Payment(s) processing has failed!
ar: فشلت معالجة جميع البيانات

# MsgSubmitPaymentsPartialSuccess
source: Some Payments Failed and others have been processed successfully
ar: لم تتم معالجة كافة البيانات بنجاح

# MsgSubmitRecordsFailure
source: Record(s) processing has failed!
ar: فشلت معالجة البيانات

# MsgSubmitRecordsPartialSuccess
source: Some Records Failed and others have been processed successfully
ar: لم تتم معالجة كافة البيانات بنجاح

# MsgSubmitRequestSuccess
source: Requets has been submitted successfully!
ar: تم إرسال طلبك بنجاح!

# MsgSubmitStockTransactionUpdateSuccess
source: Stock Transaction updated !
ar: تم تحديث البيانات بنجاح

# MsgSubmitSuccess
source: Data has been processed successfully!
ar: تمت معالجة البيانات بنجاح!

# MsgUnauthorizedAccess
source: Unauthorized Access!
ar: محاولة وصول غير مشروع

# MsgUpsertCustomerInvalidData
source: Invalid data recieved for Upsert Customer
ar: معلومات غير صحيحة لإضافة زبون جديد

# MsgUpsertCustomerSuccess
source: Customer information has been received, Changes will not appear until the manager confirms them
ar: تم استلام المعلومات بنجاح، ستتم مراجعتها من قبل الإدارة قبل أن تصبح متاحة

# MsgUpsertFailureForeignKey
source: Required Information are missing!
ar: فشلت العملية بسبب نقص في المعلومات المطلوبة

# MsgUpsertFailurePrimaryKey
source: Primary Key cannot be duplicated!
ar: فشلت العملية بسبب وجود هذا العنصر مسبقا

# MsgUpsertFailureUniqueKey
source: Unique Key cannot be duplicated!
ar: فشلت العملية لا يمكن تكرار نفس الحقل المميز

# MsgUpsertOrderStockCheckError
source: Route Stock does not have enough Stock!
ar: لا توجد كمية كافية من المنتجات المطلوبة في المخزن الحالي!

# MsgUpsertTransactionFailureDataIssue
source: Data Error: Close Balance will be negative for either Source or Destination
ar: فشلت العملية لأن الرصيد في أحد المخازن سيصبح سالبا

# MsgUpsertUserInvalidKey
source: Invalid Activation Key Or Insufficient licenses
ar: كود التفعيل غير صالح أو لا تملك تراخيص كافية
